reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---

<% Sub.all.each do |subo| %>

SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
---
  value="<%= subo.id %>"
  <%= "checked" if @post.sub_ids.include?(subo.id) %>>