reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---

<% Sub.all.each do |subo| %>