reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "FjvKUxNQoRdTa8LCB5LIUw"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = generate_session_token
    self.save!