reddit_clone/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "aF1btrEzx8S0TQ_ACU8bMg"], ["LIMIT", 1]]
---
def current_user
  @current ||= User.find_by(session_token: session[:session_token])