reddit_clone/app/controllers/posts_controller.rb

  def update
      @post = Post.find(params[:id])
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "awdwad"], ["content", "dwadwadwadawdwadwa"], ["updated_at", "2019-09-10 21:16:07.297319"], ["id", 1]]