reddit_clone/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "poopity"], ["password_digest", "$2a$12$iS6Kg.4WZcuwiVuHmZ44c.PnrXptqosa2S4gnGFTYfGa5IF3HvfS6"], ["session_token", "879PWuenl-m1PzAk12H0QQ"]]